using System.Diagnostics.CodeAnalysis;

namespace Motor.ATP._300T.共用.功能键与菜单
{
    [SuppressMessage("ReSharper", "InconsistentNaming")]
    public enum FunMenuButtonId
    {
        未选择 = 0,
        确定取消 = 9,
        确定 = 10,

        启动开始_司机号 = 100,
        启动开始_车次号 = 101,
        启动开始_司机车次号确定 = 1016,
        启动开始_制动测试_存在制动测试成功 = 1021,
        启动开始_制动测试_不存在制动测试成功 = 1022,
        

        F1数据 = 1,
        F1数据_F1司机号 = 11,
        F1数据_F1司机号_F6确定 = 116,
        F1数据_F2车次号 = 12,
        F1数据_F2车次号_F6确定 = 126,
        F1数据_F3列车数据 = 13,
        F1数据_F3列车数据_F6确定 = 136,

        F2模式 = 2,
        F2模式_F1进入调车 = 210,
        F2模式_F2进入目视 = 220,
        F2模式_F3进入机信 = 230,
        F2模式_F1退出调车 = 211,
        F2模式_F2退出目视 = 221,
        F2模式_F3退出机信 = 231,

        F3载频 = 3,
        F3载频_F1上行 = 31,
        F3载频_F1上行_确定 = 316,
        F3载频_F2下行 = 32,
        F3载频_F2下行_确定 = 326,

        F4等级 = 4,
        F4等级_F1CTCS3 = 41,
        F4等级_F1CTCS3_RBC = 411,
        F4等级_F1CTCS3_电话号码 = 412,
        F4等级_F1CTCS3_网络ID = 413,
        F4等级_F2CTCS3_RBC确认 = 4116,
        F4等级_F2CTCS2 = 42,
        F4等级_F1_CTCS3_确认=414,
           


        
        F5其他 = 5,
        F5制动测试 = 51,
        F5其他_F2音量 = 52,
        F5其他_F3亮度 = 53,

        F6启动 = 6,
        F6启动_F6确定 = 66,

        F7缓解 = 7,
        F7缓解_F6确定 = 76,

        F8警惕 = 8,
    }
}