namespace CBTC.Infrasturcture.Model.Constant
{
    /// <summary>
    /// 操作门方式
    /// </summary>
    public enum DoorOperateType
    {
        /// <summary>
        /// 允许手动方式开左门，且左右门均关好
        ///        允许手动方式开左门，且车门未关闭
        ///允许手动方式开右门，且左右门均关好
        ///允许手动方式开右门，且车门未关闭
        ///允许手动方式开两侧门，且左右门均关好
        ///允许手动方式开两侧门，且车门未关闭
        ///允许手动方式先开左门，后开右门，且左右门均关好
        ///允许手动方式先开左门，后开右门，且车门未关闭
        ///允许手动方式先开右门，后开左门，且左右门均关好
        ///允许手动方式先开右门，后开左门，且车门未关闭
        ///允许自动方式开左门，且左右门均关好
        ///允许自动方式开左门，且车门未关闭
        ///允许自动方式开右门，且左右门均关好
        ///允许自动方式开右门，且车门未关闭
        ///允许自动方式开两侧门，且左右门均关好
        ///允许自动方式开两侧门，且车门未关闭
        ///允许自动方式先开左门，后开右门，且左右门均关好
        ///允许自动方式先开左门，后开右门，且车门未关闭
        ///允许自动方式先开右门，后开左门，且左右门均关好
        ///允许自动方式先开右门，后开左门，且车门未关闭
        ///
        /// </summary>
        AllowOpenLeftAndBothClosed,

        // TODO ADD others
    }
}