using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace NC_TMS.Common
{
    /// <summary>
    /// 功能描述：视图状态枚举
    /// </summary>
    public enum ViewState
    {
        黑屏 = 0,

        运行 = 1,
        故障提示 = 101,
        火灾重启 = 102,
        紧急广播 = 103,
        站点 = 104,
        提示信息_方向列表 = 105,
        提示信息_列车逻辑 = 106,
        提示信息_限速条件 = 107,
        提示信息_旁路信息 = 108,

        车辆状态 = 2,

        空调_模式选择 = 3,
        空调_温度控制 = 301,

        故障 = 4,

        网络通讯 = 5,

        帮助 = 6,
        运行帮助 = 601,
        车辆帮助 = 602,
        空调帮助 = 603,
        通讯帮助 = 604,

        检修 = 7,
        登陆 = 701,
        时间设置 = 702,
        密码设置 = 703,
        轮径设置 = 704,
        车号设置 = 705,
        加速度测试 = 706,
        测试 = 707,
        数据记录 = 708,
        USB = 709,
        维护指南 = 710,
        端口数据 = 711,
        版本 = 712,
        IO = 713
    }
}
